Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: In order for the OpenEmbedded build system to create an image or any target, it must be able to access source files. The :ref:`general workflow figure <overview-manual/concepts:openembedded build system concepts>` represents source files using the "Upstream Project Releases", "Local Projects", and "SCMs (optional)" boxes. The figure represents mirrors, which also play a role in locating source files, with the "Source Materials" box.
it_it: Affinché il sistema di build OpenEmbedded possa creare un'immagine o qualsiasi target, deve essere in grado di accedere ai file sorgente. La :ref:`figura del flusso di lavoro generale <overview-manual/concepts:openembedded build system concepts>` rappresenta i file sorgente utilizzando i riquadri "Upstream Project Releases", "Local Projects" E "SCMs (optional)". La figura rappresenta anche i mirror, che svolgono un ruolo nell'individuazione dei file sorgente, con il riquadro "Source Materials".

source: In order for the ``checksettings`` command to work, the database must be correctly set up and not have existing data. To be sure the database is ready, you can run the following:
it_it: Affinché il comando ``checksettings`` funzioni, il database deve essere configurato correttamente e non contenere dati preesistenti. Per verificare che il database sia pronto, è possibile eseguire i seguenti comandi:

source: In order to accomplish steps 1 and 2, the ``stap`` program needs access to the kernel build system that produced the kernel that the probed system is running. In the case of a typical embedded system (the "target"), the kernel build system unfortunately isn't typically part of the image running on the target. It is normally available on the "host" system that produced the target image however; in such cases, steps 1 and 2 are executed on the host system, and steps 3 and 4 are executed on the target system, using only the SystemTap "runtime".
it_it: Per eseguire i passaggi 1 e 2, il programma ``stap`` necessita dell'accesso al sistema di compilazione del kernel che ha prodotto il kernel in esecuzione sul sistema sottoposto a sonda [probe]. Nel caso di un tipico sistema embedded (il "target"), il sistema di build del kernel purtroppo non fa in genere parte dell'immagine in esecuzione sul target. Normalmente è disponibile sul sistema "host" che ha prodotto l'immagine target; in questi casi, i passaggi 1 e 2 vengono eseguiti sul sistema host, mentre i passaggi 3 e 4 vengono eseguiti sul sistema target, utilizzando solo il runtime di SystemTap.

source: In order to configure and use Toaster, you should understand some concepts and have some basic command reference material available. This final chapter provides conceptual information on layer sources, releases, and JSON configuration files. Also provided is a quick look at some useful ``manage.py`` commands that are Toaster-specific. Information on ``manage.py`` commands is available across the Web and this manual by no means attempts to provide a command comprehensive reference.
it_it: Per configurare e utilizzare Toaster, è necessario comprendere alcuni concetti e disporre di un riferimento di base sui comandi. Questo capitolo finale fornisce informazioni concettuali sui sorgenti dei layer, le release e i file di configurazione JSON. Viene inoltre fornita una rapida panoramica di alcuni utili comandi ``manage.py`` specifici di Toaster. Informazioni sui comandi ``manage.py`` sono disponibili sul Web e questo manuale non intende in alcun modo fornire un riferimento completo dei comandi.

source: In order to do this from a remote host, however, you need to have access to the build for the image you booted. The ``crosstap`` script provides details on how to do this if you run the script on the host without having done a build::
it_it: Per fare ciò da un host remoto, tuttavia, è necessario avere accesso alla build dell'immagine avviata. Lo script ``crosstap`` fornisce i dettagli su come fare se lo si esegue sull'host senza aver prima effettuato una build::

source: In order to have a better control of vulnerabilities, patches that fix CVEs must contain a ``CVE:`` tag. This tag should list all CVEs fixed by the patch. If more than one CVE is fixed, separate them using spaces.
it_it: Per un migliore controllo delle vulnerabilità, le patch che risolvono le CVE devono contenere il tag ``CVE:``. Questo tag dovrebbe elencare tutte le CVE risolte dalla patch. Se vengono risolte più CVE, separarle con degli spazi.

source: In order to keep track of patches applied by recipes and ultimately reduce the number of patches that need maintaining, the OpenEmbedded build system requires information about the upstream status of each patch.
it_it: Per tenere traccia delle patch applicate dalle ricette e, in definitiva, ridurre il numero di patch da gestire, il sistema di build di OpenEmbedded richiede informazioni sullo stato di ciascuna patch nel progetto upstream [principale].

source: In order to use Toaster, you must configure the database with the default content. The following subsections describe various aspects of Toaster configuration.
it_it: Per utilizzare Toaster, è necessario configurare il database con i contenuti di default. Le seguenti sottosezioni descrivono vari aspetti della configurazione di Toaster.

source: In order to use the build system, your host development system must meet the following version requirements for Git, tar, and Python:
it_it: Per utilizzare il sistema di build, il sistema host di sviluppo deve soddisfare i seguenti requisiti di versione per Git, tar e Python:

source: In order to use this feature, you can get the correct version of ``python3-websockets`` by either:
it_it: Per utilizzare questa funzionalità, si può ottenere la versione corretta di ``python3-websockets`` in uno dei seguenti modi:

source: In particular, the Yocto Project does not support and currently has no plans to support rolling-releases or development distributions due to their constantly changing nature. We welcome patches and bug reports, but keep in mind that our priority is on the supported platforms listed above.
it_it: In particolare, Yocto Project non supporta e al momento non prevede di supportare distribuzioni "rolling release" o di sviluppo, data la loro natura in continua evoluzione. Accogliamo con favore patch e segnalazioni di bug, ma si tenga presente che la nostra priorità è rappresentata dalle piattaforme supportate elencate sopra.

source: In particular, you'll get the most mileage out of perf if you profile an image built with the following in a :term:`configuration file`::
it_it: In particolare, si otterrà il massimo da perf se si profila un'immagine creata con quanto segue in un :term:`configuration file`::

source: In practice, only a few recipes make use of the ``work-shared`` directory. This directory is especially useful for recipes that would induce a lot of storage space if they were to be shared with the standard :term:`Sysroot` mechanism.
it_it: In pratica, solo poche ricette utilizzano la directory ``work-shared``. Questa directory è particolarmente utile per le ricette che richiederebbero molto spazio di archiviazione se fossero condivise con il meccanismo standard :term:`Sysroot`.

source: In rare cases, a severe security issue affects multiple projects. This might be numerous projects having a similar issue because of design, coding pattern, or reuse of the same code (an example of this situation is :cve_nist:`2023-44487` where multiple web servers share a design weakness). It might also be a high-profile issue in a commonly used library (like OpenSSL). In such cases, the project, learning first about the issue, might decide to notify other affected projects confidentially so that they come up with a synchronized fix. It might also be the affected project informing major distributions to roll out the update simultaneously.
it_it: In rari casi, un grave problema di sicurezza può interessare più progetti. Potrebbe trattarsi di numerosi progetti che presentano un problema simile a causa della progettazione, del modello di codifica o del riutilizzo dello stesso codice (un esempio di questa situazione è :cve_nist:`2023-44487`, in cui più server web condividono una vulnerabilità di progettazione). Potrebbe anche trattarsi di un problema di alto profilo in una libreria di uso comune (come OpenSSL). In questi casi, il progetto che viene a conoscenza del problema per primo potrebbe decidere di notificare in via confidenziale gli altri progetti interessati, in modo che possano sviluppare una soluzione sincronizzata. Potrebbe anche trattarsi del progetto interessato che informa le principali distribuzioni affinché rilascino l'aggiornamento simultaneamente.

source: In some cases, a BSP contains separately-licensed Intellectual Property (IP) for a component or components. For these cases, you are required to accept the terms of a commercial or other type of license that requires some kind of explicit End User License Agreement (EULA). Once you accept the license, the OpenEmbedded build system can then build and include the corresponding component in the final BSP image. If the BSP is available as a pre-built image, you can download the image after agreeing to the license or EULA.
it_it: In alcuni casi, un BSP contiene Intellectual Property (IP) [proprietà intellettuale] soggetta a licenza separata per uno o più componenti. In questi casi, è necessario accettare i termini di una licenza commerciale o di altro tipo che richieda un End User License Agreement (EULA) [Contratto di Licenza per l'Utente Finale] esplicito. Una volta accettata la licenza, il sistema di build OpenEmbedded può compilare e includere il componente corrispondente nell'immagine BSP finale. Se il BSP è disponibile come immagine precompilata, è possibile scaricarla dopo aver accettato la licenza o l'EULA.

source: In some cases, it might not be convenient to include a bootable image. If so, you might want to make two versions of the BSP available: one that contains binary images, and one that does not. The version that does not contain bootable images avoids unnecessary download times for users not interested in the images.
it_it: In alcuni casi, potrebbe non essere conveniente includere un'immagine avviabile. In tal caso, si potrebbe rendere disponibili due versioni del BSP: una contenente immagini binarie e una senza. La versione senza immagini avviabili evita tempi di download inutili per gli utenti non interessati alle immagini.

source: In some circumstances, a layer can be created by the community in order to add a specific feature or support a new version of some package for an :term:`LTS` release. This is called a :term:`Mixin` layer. These are thin and specific purpose layers which can be stacked with an :term:`LTS` release to "mix" a specific feature into that build. These are created on an as-needed basis and maintained by the people who need them.
it_it: In alcuni casi, la community può creare un layer per aggiungere una funzionalità specifica o supportare una nuova versione di un pacchetto per una versione :term:`LTS`. Questo viene chiamato layer :term:`Mixin`. Si tratta di layer sottili e specifici che possono essere sovrapposti a una release :term:`LTS` per "integrare" una funzionalità specifica in quella build. Vengono creati in base alle necessità e gestiti da chi ne ha bisogno.

source: In summary, here is where you can get the project files needed for development:
it_it: In sintesi, ecco dove è possibile trovare i file di progetto necessari per lo sviluppo:

source: In summary, there is a single point of entry for changes into the development branch of the Git repository, which is controlled by the project's maintainer. A set of developers independently develop, test, and submit changes to "contrib" areas for the maintainer to examine. The maintainer then chooses which changes are going to become a permanent part of the project.
it_it: In sintesi, esiste un unico punto di accesso per le modifiche al branch di sviluppo del repository Git, controllato dal manutentore del progetto. Un gruppo di sviluppatori sviluppa, testa e invia autonomamente le modifiche alle aree "contrib" affinché il manutentore le esamini. Il manutentore sceglie quindi quali modifiche verranno integrate in modo permanente nel progetto.

source: In the :ref:`general workflow figure <overview-manual/concepts:openembedded build system concepts>`, the output labeled "Application Development SDK" represents an SDK. The SDK generation process differs depending on whether you build an extensible SDK (e.g. ``bitbake -c populate_sdk_ext`` imagename) or a standard SDK (e.g. ``bitbake -c populate_sdk`` imagename). This section takes a closer look at this output:
it_it: Nella :ref:`figura del flusso di lavoro generale <overview-manual/concepts:openembedded build system concepts>`, l'output etichettato "Application Development SDK" rappresenta un SDK. Il processo di generazione dell'SDK varia a seconda che si stia creando un SDK estensibile (ad esempio, ``bitbake -c populate_sdk_ext`` imagename) o un SDK standard (ad esempio, ``bitbake -c populate_sdk`` imagename). Questa sezione esamina più da vicino questo output:

source: In the :term:`OpenEmbedded Build System`, the program that implements fakeroot is known as :yocto_home:`Pseudo </software-item/pseudo/>`. Pseudo overrides system calls by using the environment variable ``LD_PRELOAD``, which results in the illusion of running as root. To keep track of "fake" file ownership and permissions resulting from operations that require root permissions, Pseudo uses an SQLite 3 database. This database is stored in ``${``\ :term:`WORKDIR`\ ``}/pseudo/files.db`` for individual recipes. Storing the database in a file as opposed to in memory gives persistence between tasks and builds, which is not accomplished using fakeroot.
it_it: Nel :term:`OpenEmbedded Build System`, il programma che implementa fakeroot è noto come :yocto_home:`Pseudo </software-item/pseudo/>`. Pseudo sovrascrive le chiamate di sistema utilizzando la variabile d'ambiente ``LD_PRELOAD``, creando l'illusione di essere in esecuzione come root. Per tenere traccia della proprietà e dei permessi "fittizi" dei file risultanti da operazioni che richiedono i permessi di root, Pseudo utilizza un database SQLite 3. Questo database è memorizzato in ``${``\ :term:`WORKDIR`\ ``}/pseudo/files.db`` per ogni singola ricetta. La memorizzazione del database in un file anziché in memoria garantisce la persistenza tra le attività e le build, cosa che non si ottiene con fakeroot.

source: In the Yocto Project development environment, cross-development toolchains are used to build images and applications that run on the target hardware. With just a few commands, the OpenEmbedded build system creates these necessary toolchains for you.
it_it: Nell'ambiente di sviluppo di Yocto Project, le toolchain di cross-sviluppo vengono utilizzate per creare immagini e applicazioni che vengono eseguite sull'hardware target. Con pochi comandi, il sistema di build OpenEmbedded crea automaticamente le toolchain necessarie.

source: In the above example, take note of the ``4049A47E3AAA99D0250966DC5B97632FA7F4E942`` key identifier. This will be used to configure the build.
it_it: Nell'esempio precedente, prendere nota dell'identificativo della chiave ``4049A47E3AAA99D0250966DC5B97632FA7F4E942``. Questo verrà utilizzato per configurare la build.

source: In the above screenshot, we've decided to explore the graphics subsystem a bit and so have chosen to trace all the tracepoints contained within the ``i915`` and ``drm`` subsystems.
it_it: Nella schermata precedente, abbiamo deciso di esplorare il sottosistema grafico e quindi abbiamo scelto di tracciare tutti i tracepoints contenuti nei sottosistemi ``i915`` e ``drm``.

source: In the build system, the common tasks that have setscene variants are :ref:`ref-tasks-package`, :ref:`do_package_write_* <ref-tasks-package_write_deb>`, :ref:`ref-tasks-deploy`, :ref:`ref-tasks-packagedata`, and :ref:`ref-tasks-populate_sysroot`. Notice that these tasks represent most of the tasks whose output is an end result.
it_it: Nel sistema di build, i task comuni che hanno varianti di setscene sono :ref:`ref-tasks-package`, :ref:`do_package_write_* <ref-tasks-package_write_deb>`, :ref:`ref-tasks-deploy`, :ref:`ref-tasks-packagedata` e :ref:`ref-tasks-populate_sysroot`. Si noti che questi task rappresentano la maggior parte dei task il cui output è un risultato finale.

source: In the context of cross-compiling toolchains, a *sysroot* typically contains C library and kernel headers, plus the compiled binaries for the C library. A *multilib toolchain* can contain multiple variants of the C library binaries, each compiled for a target instruction set (such as ``armv5``, ``armv7`` and ``armv8``), and possibly optimized for a specific CPU core.
it_it: Nel contesto delle toolchain di cross-compilazione, una *sysroot* contiene tipicamente le librerie C e gli header del kernel, oltre ai binari compilati per la libreria C. Una *toolchain multilib* può contenere diverse varianti dei binari della libreria C, ciascuna compilata per un set di istruzioni target (come ``armv5``, ``armv7`` e ``armv8``), ed eventualmente ottimizzata per uno specifico core della CPU.

source: In the context of the Yocto Project, this term refers to a recipe's packaged output produced by BitBake (i.e. a "baked recipe"). A package is generally the compiled binaries produced from the recipe's sources. You "bake" something by running it through BitBake.
it_it: Nel contesto di Yocto Project, questo termine [pacchetto] si riferisce all'output impacchettato di una ricetta prodotto da BitBake (ovvero una "baked recipe"). Un pacchetto [package] è generalmente costituito dai binari compilati prodotti dai sorgenti di una ricetta. Si "cucina" (ndt: bake=cucinare ovvero compilare) qualcosa eseguendola tramite BitBake [ndt:CucinaBit].

source: In the context of the kernel ("kernel Metadata"), the term refers to the kernel config fragments and features contained in the :yocto_git:`yocto-kernel-cache </yocto-kernel-cache>` Git repository.
it_it: Nel contesto del kernel ("kernel Metadata"), il termine si riferisce ai frammenti di configurazione del kernel e alle funzionalità contenute nel repository Git :yocto_git:`yocto-kernel-cache </yocto-kernel-cache>`.

source: In the example, this corresponds to the identifier printed with the ``gpg --list-keys`` command :ref:`above <security-manual/sstate-signing:Generating A Public And Private Key Pair With GPG>`.
it_it: Nell'esempio, questo corrisponde all'identificativo visualizzato con il comando ``gpg --list-keys`` :ref:`precedente <security-manual/sstate-signing:Generating A Public And Private Key Pair With GPG>`.

source: In the more specific context of the OpenEmbedded build System and of the Yocto Project, each recipe has two sysroots:
it_it: Nel contesto più specifico del sistema di build OpenEmbedded e di Yocto Project, ogni ricetta ha due sysroot:

source: In the previous example after moving to the home directory, the ``git clone`` command creates a local copy of the upstream ``yocto-docs`` Git repository and checks out a local branch named "blacksail", which tracks the upstream "origin/blacksail" branch. Changes you make while in this branch would ultimately affect the upstream "blacksail" branch of the ``yocto-docs`` repository.
it_it: Nell'esempio precedente, dopo essersi spostati nella directory home, il comando ``git clone`` crea una copia locale del repository Git ``yocto-docs`` ee esegue il "checkout" di un branch locale chiamato "blacksail", che traccia il branch "origin/blacksail" del repository principale. Le modifiche apportate in questo branch influenzeranno in definitiva il branch "blacksail" del repository principale ``yocto-docs``.

source: In the previous example, from the ``poky`` directory, the ``migrate`` command ensures the database schema changes have propagated correctly (i.e. migrations). The next line sets the Toaster root directory ``TOASTER_DIR`` and the location of the Toaster configuration file ``TOASTER_CONF``, which is relative to ``TOASTER_DIR``. The :term:`TEMPLATECONF` value reflects the contents of ``poky/.templateconf``, and by default, should include the string "poky". For more information on the Toaster configuration file, see the ":ref:`toaster-manual/reference:Configuring Toaster`" section.
it_it: Nell'esempio precedente, dalla directory ``poky``, il comando ``migrate`` garantisce che le modifiche allo schema del database siano state propagate correttamente (ovvero, esegue le migrazioni). La riga successiva imposta la directory radice di Toaster ``TOASTER_DIR`` e la posizione del file di configurazione di Toaster ``TOASTER_CONF``, che è relativa a ``TOASTER_DIR``. Il valore di :term:`TEMPLATECONF` riflette il contenuto di ``poky/.templateconf`` e, per default, dovrebbe includere la stringa "poky". Per ulteriori informazioni sul file di configurazione di Toaster, consultare la sezione ":ref:`toaster-manual/reference:Configuring Toaster`".

source: In the previous figure, notice that there are two sample hierarchies: one based on package architecture (i.e. :term:`PACKAGE_ARCH`) and one based on a machine (i.e. :term:`MACHINE`). The underlying structures are identical. The differentiator being what the OpenEmbedded build system is using as a build target (e.g. general architecture, a build host, an SDK, or a specific machine).
it_it: Nella figura precedente, si noti che sono presenti due gerarchie di esempio: una basata sull'architettura del pacchetto (ovvero :term:`PACKAGE_ARCH`) e una basata sulla macchina (ovvero :term:`MACHINE`). Le strutture sottostanti sono identiche. La differenza risiede nell'elemento utilizzato dal sistema di build OpenEmbedded come target di compilazione (ad esempio, architettura generale, host di compilazione, SDK o una macchina specifica).

source: In the previous section, the code for the OpenEmbedded Metadata Index (i.e. :oe_layerindex:`/`) was referenced. You can use this code, which is at :yocto_git:`/layerindex-web/`, as a base to create your own layer index.
it_it: Nella sezione precedente, è stato fatto riferimento al codice dell'Indice di Metadati OpenEmbedded (ovvero :oe_layerindex:`/`) È possibile utilizzare questo codice, che si trova in :yocto_git:`/layerindex-web/`, come base per creare il proprio indice di layer.

source: In the screenshot above, we're focusing on ``__copy_to_user_ll()`` and looking up the call chain we can see that one of the callers of ``__copy_to_user_ll`` is ``sys_read()`` and the complete call path between them. Notice that this is essentially a portion of the same information we saw in the perf display shown in the perf section of this page.
it_it: Nella schermata sopra, ci concentriamo su ``__copy_to_user_ll()`` e, osservando la catena di chiamate, possiamo vedere che uno dei chiamanti di ``__copy_to_user_ll`` è ``sys_read()`` e il percorso completo delle chiamate tra di essi. Si noti che si tratta essenzialmente di una parte delle stesse informazioni che abbiamo visto nella visualizzazione di perf mostrata nella sezione perf di questa pagina.

source: In the screenshot above, we've toggled the ``__copy_to_user_ll()`` entry and several subnodes all the way down. This lets us see which call chains contributed to the profiled ``__copy_to_user_ll()`` function which contributed 1.77% to the total profile.
it_it: Nella schermata qui sopra, abbiamo attivato la voce ``__copy_to_user_ll()`` e diversi sotto-nodi fino in fondo. Questo ci permette di vedere quali catene di chiamate hanno contribuito alla funzione ``__copy_to_user_ll()`` profilata, che ha contribuito per l'1,77% al profilo totale.
